In [4]:
import numpy as np
import pandas as pd

In [5]:
# DataFrame from Series made using dictionary

num_years = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                    index = [2012,2008,2004,2000,1996])
df = pd.DataFrame({'No. of Participating Countries': num_years,
                  'Host Cities': country})
df

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [6]:
df.describe

<bound method NDFrame.describe of       No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [7]:
df.head(2) #top most records

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [8]:
df.tail(3) # bottom most records

      No. of Participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [9]:
df.index # to view the indices of DataFrame

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [10]:
df.columns # to view the column names of DataFrame

Index(['No. of Participating Countries', 'Host Cities'], dtype='object')

In [11]:
df['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [12]:
df['No. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries, dtype: int64

In [13]:
# accessing by label indices
df.loc[2012]

No. of Participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [17]:
# accessing by default indices
df.iloc[0:5] # slicing

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [16]:
# iat
df.iat[3,1] # accessing by matrix element position

'Sydney'

In [19]:
# certain conditions output
df[df['No. of Participating Countries']>200]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens